In [18]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
data ={
    'name' :["person1", "person2", "person3", "person4", "person5", "person6"],
    'age' : [20,25,np.nan,30,40,np.nan],
    'salary': [10000, 20000, np.nan, 30000, 18000, 54000],
    'gender':  ["male", "female", "female", "male", "male", "male"]}

df = pd.DataFrame(data)

In [38]:
df_copy0=df.copy()

In [39]:
df_copy0

      name   age   salary  gender
0  person1  20.0  10000.0    male
1  person2  25.0  20000.0  female
2  person3   NaN      NaN  female
3  person4  30.0  30000.0    male
4  person5  40.0  18000.0    male
5  person6   NaN  54000.0    male

In [50]:
from sklearn.preprocessing import LabelEncoder

df_copy0['gender'] = LabelEncoder().fit_transform(df_copy0['gender'])

In [51]:
df_copy0

      name   age   salary  gender
0  person1  20.0  10000.0       1
1  person2  25.0  20000.0       0
2  person3   NaN      NaN       0
3  person4  30.0  30000.0       1
4  person5  40.0  18000.0       1
5  person6   NaN  54000.0       1

In [52]:
df_copy2 = df.copy()

In [55]:
df_copy2.drop(['name','age','salary'],axis=1,inplace=True)

In [58]:
df_copy2

   gender
0    male
1  female
2  female
3    male
4    male
5    male

In [57]:
from sklearn.preprocessing import OneHotEncoder
encoder = OneHotEncoder(handle_unknown='ignore')
encoder = encoder.fit(df_copy2)

In [59]:
encoder.categories_

[array(['female', 'male'], dtype=object)]

In [61]:
tras_value= encoder.transform(df_copy2).toarray()

tras_value = pd.DataFrame(tras_value,columns=encoder.categories_)
tras_value

  female male
0    0.0  1.0
1    1.0  0.0
2    1.0  0.0
3    0.0  1.0
4    0.0  1.0
5    0.0  1.0

In [66]:
df_copy3 = df.copy()

df_copy3['G_f'] = tras_value['female']
df_copy3['G_m'] = tras_value['male']
del df_copy3['gender']
df_copy3

      name   age   salary  G_f  G_m
0  person1  20.0  10000.0  0.0  1.0
1  person2  25.0  20000.0  1.0  0.0
2  person3   NaN      NaN  1.0  0.0
3  person4  30.0  30000.0  0.0  1.0
4  person5  40.0  18000.0  0.0  1.0
5  person6   NaN  54000.0  0.0  1.0

In [67]:
df_copy4 =  df.copy